app/controllers/events_controller.rb

      def create
        family = Family.create(name: params[:family])
        report = Report.create(headline: params[:headline], content: params[:content])
        event = Event.create(family_id: family.id, report_id: report.id)
---
INSERT INTO "families" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Smith"], ["created_at", "2021-01-17 20:39:16.674158"], ["updated_at", "2021-01-17 20:39:16.674158"]]
INSERT INTO "reports" ("headline", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["headline", "Hello"], ["content", "hey is this working?"], ["created_at", "2021-01-17 20:39:16.730403"], ["updated_at", "2021-01-17 20:39:16.730403"]]
INSERT INTO "events" ("family_id", "report_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["family_id", 11], ["report_id", 15], ["created_at", "2021-01-17 20:39:16.843521"], ["updated_at", "2021-01-17 20:39:16.843521"]]

      def show
        event = Event.find_by(id: params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

      def destroy
        event = Event.find(params[:id])
        event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 10]]