app/controllers/families_controller.rb

SELECT "families".* FROM "families"
---
    def index
        @families = Family.all

SELECT "families".* FROM "families" WHERE "families"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @family = Family.find(params[:id])