app/controllers/reports_controller.rb

    def index
        @reports = Report.all
---
SELECT "reports".* FROM "reports"

    def show
        @report = Report.find(params[:id])
---
SELECT "reports".* FROM "reports" WHERE "reports"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create

        report = Report.create(report_params)
---
INSERT INTO "reports" ("headline", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["headline", "Hello"], ["content", "hey is this working?"], ["created_at", "2021-01-17 20:21:09.357819"], ["updated_at", "2021-01-17 20:21:09.357819"]]